Improved architecture diagrams
